Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
efficientnetb2 (Functional)  (None, None, None, 1408)  7768569   
_________________________________________________________________
global_max_pooling2d (Global (None, 1408)              0         
_________________________________________________________________
dropout (Dropout)            (None, 1408)              0         
_________________________________________________________________
dense (Dense)                (None, 4)                 5636      
=================================================================
Total params: 7,774,205
Trainable params: 7,706,630
Non-trainable params: 67,575
_________________________________________________________________
