Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
efficientnetb2 (Functional)  (None, None, None, 1408)  7768569   
_________________________________________________________________
global_max_pooling2d (Global (None, 1408)              0         
_________________________________________________________________
dropout (Dropout)            (None, 1408)              0         
_________________________________________________________________
dense (Dense)                (None, 2)                 2818      
=================================================================
Total params: 7,771,387
Trainable params: 1,241,858
Non-trainable params: 6,529,529
_________________________________________________________________
